grevaillot/svd_tools/headers/ATSAM3X8H/dmac.h
#pragma once 

/* --- DMAC: DMA Controller ----------------------------------------- */

/** @defgroup dmac_registers DMA Controller Register
@{*/

/** DMAC_GCFG DMAC Global Configuration Register **/
#define DMAC_GCFG			MMIO32(DMAC_BASE + 0x00)
/** DMAC_EN DMAC Enable Register **/
#define DMAC_EN			MMIO32(DMAC_BASE + 0x04)
/** DMAC_SREQ DMAC Software Single Request Register **/
#define DMAC_SREQ			MMIO32(DMAC_BASE + 0x08)
/** DMAC_CREQ DMAC Software Chunk Transfer Request Register **/
#define DMAC_CREQ			MMIO32(DMAC_BASE + 0x0c)
/** DMAC_LAST DMAC Software Last Transfer Flag Register **/
#define DMAC_LAST			MMIO32(DMAC_BASE + 0x10)
/** DMAC_EBCIER DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Enable register. **/
#define DMAC_EBCIER			MMIO32(DMAC_BASE + 0x18)
/** DMAC_EBCIDR DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Disable register. **/
#define DMAC_EBCIDR			MMIO32(DMAC_BASE + 0x1c)
/** DMAC_EBCIMR DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer transfer completed Mask Register. **/
#define DMAC_EBCIMR			MMIO32(DMAC_BASE + 0x20)
/** DMAC_EBCISR DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer transfer completed Status Register. **/
#define DMAC_EBCISR			MMIO32(DMAC_BASE + 0x24)
/** DMAC_CHER DMAC Channel Handler Enable Register **/
#define DMAC_CHER			MMIO32(DMAC_BASE + 0x28)
/** DMAC_CHDR DMAC Channel Handler Disable Register **/
#define DMAC_CHDR			MMIO32(DMAC_BASE + 0x2c)
/** DMAC_CHSR DMAC Channel Handler Status Register **/
#define DMAC_CHSR			MMIO32(DMAC_BASE + 0x30)
/** DMAC_SADDR0 DMAC Channel Source Address Register (ch_num = 0) **/
#define DMAC_SADDR0			MMIO32(DMAC_BASE + 0x3c)
/** DMAC_DADDR0 DMAC Channel Destination Address Register (ch_num = 0) **/
#define DMAC_DADDR0			MMIO32(DMAC_BASE + 0x40)
/** DMAC_DSCR0 DMAC Channel Descriptor Address Register (ch_num = 0) **/
#define DMAC_DSCR0			MMIO32(DMAC_BASE + 0x44)
/** DMAC_CTRLA0 DMAC Channel Control A Register (ch_num = 0) **/
#define DMAC_CTRLA0			MMIO32(DMAC_BASE + 0x48)
/** DMAC_CTRLB0 DMAC Channel Control B Register (ch_num = 0) **/
#define DMAC_CTRLB0			MMIO32(DMAC_BASE + 0x4c)
/** DMAC_CFG0 DMAC Channel Configuration Register (ch_num = 0) **/
#define DMAC_CFG0			MMIO32(DMAC_BASE + 0x50)
/** DMAC_SADDR1 DMAC Channel Source Address Register (ch_num = 1) **/
#define DMAC_SADDR1			MMIO32(DMAC_BASE + 0x64)
/** DMAC_DADDR1 DMAC Channel Destination Address Register (ch_num = 1) **/
#define DMAC_DADDR1			MMIO32(DMAC_BASE + 0x68)
/** DMAC_DSCR1 DMAC Channel Descriptor Address Register (ch_num = 1) **/
#define DMAC_DSCR1			MMIO32(DMAC_BASE + 0x6c)
/** DMAC_CTRLA1 DMAC Channel Control A Register (ch_num = 1) **/
#define DMAC_CTRLA1			MMIO32(DMAC_BASE + 0x70)
/** DMAC_CTRLB1 DMAC Channel Control B Register (ch_num = 1) **/
#define DMAC_CTRLB1			MMIO32(DMAC_BASE + 0x74)
/** DMAC_CFG1 DMAC Channel Configuration Register (ch_num = 1) **/
#define DMAC_CFG1			MMIO32(DMAC_BASE + 0x78)
/** DMAC_SADDR2 DMAC Channel Source Address Register (ch_num = 2) **/
#define DMAC_SADDR2			MMIO32(DMAC_BASE + 0x8c)
/** DMAC_DADDR2 DMAC Channel Destination Address Register (ch_num = 2) **/
#define DMAC_DADDR2			MMIO32(DMAC_BASE + 0x90)
/** DMAC_DSCR2 DMAC Channel Descriptor Address Register (ch_num = 2) **/
#define DMAC_DSCR2			MMIO32(DMAC_BASE + 0x94)
/** DMAC_CTRLA2 DMAC Channel Control A Register (ch_num = 2) **/
#define DMAC_CTRLA2			MMIO32(DMAC_BASE + 0x98)
/** DMAC_CTRLB2 DMAC Channel Control B Register (ch_num = 2) **/
#define DMAC_CTRLB2			MMIO32(DMAC_BASE + 0x9c)
/** DMAC_CFG2 DMAC Channel Configuration Register (ch_num = 2) **/
#define DMAC_CFG2			MMIO32(DMAC_BASE + 0xa0)
/** DMAC_SADDR3 DMAC Channel Source Address Register (ch_num = 3) **/
#define DMAC_SADDR3			MMIO32(DMAC_BASE + 0xb4)
/** DMAC_DADDR3 DMAC Channel Destination Address Register (ch_num = 3) **/
#define DMAC_DADDR3			MMIO32(DMAC_BASE + 0xb8)
/** DMAC_DSCR3 DMAC Channel Descriptor Address Register (ch_num = 3) **/
#define DMAC_DSCR3			MMIO32(DMAC_BASE + 0xbc)
/** DMAC_CTRLA3 DMAC Channel Control A Register (ch_num = 3) **/
#define DMAC_CTRLA3			MMIO32(DMAC_BASE + 0xc0)
/** DMAC_CTRLB3 DMAC Channel Control B Register (ch_num = 3) **/
#define DMAC_CTRLB3			MMIO32(DMAC_BASE + 0xc4)
/** DMAC_CFG3 DMAC Channel Configuration Register (ch_num = 3) **/
#define DMAC_CFG3			MMIO32(DMAC_BASE + 0xc8)
/** DMAC_SADDR4 DMAC Channel Source Address Register (ch_num = 4) **/
#define DMAC_SADDR4			MMIO32(DMAC_BASE + 0xdc)
/** DMAC_DADDR4 DMAC Channel Destination Address Register (ch_num = 4) **/
#define DMAC_DADDR4			MMIO32(DMAC_BASE + 0xe0)
/** DMAC_DSCR4 DMAC Channel Descriptor Address Register (ch_num = 4) **/
#define DMAC_DSCR4			MMIO32(DMAC_BASE + 0xe4)
/** DMAC_CTRLA4 DMAC Channel Control A Register (ch_num = 4) **/
#define DMAC_CTRLA4			MMIO32(DMAC_BASE + 0xe8)
/** DMAC_CTRLB4 DMAC Channel Control B Register (ch_num = 4) **/
#define DMAC_CTRLB4			MMIO32(DMAC_BASE + 0xec)
/** DMAC_CFG4 DMAC Channel Configuration Register (ch_num = 4) **/
#define DMAC_CFG4			MMIO32(DMAC_BASE + 0xf0)
/** DMAC_SADDR5 DMAC Channel Source Address Register (ch_num = 5) **/
#define DMAC_SADDR5			MMIO32(DMAC_BASE + 0x104)
/** DMAC_DADDR5 DMAC Channel Destination Address Register (ch_num = 5) **/
#define DMAC_DADDR5			MMIO32(DMAC_BASE + 0x108)
/** DMAC_DSCR5 DMAC Channel Descriptor Address Register (ch_num = 5) **/
#define DMAC_DSCR5			MMIO32(DMAC_BASE + 0x10c)
/** DMAC_CTRLA5 DMAC Channel Control A Register (ch_num = 5) **/
#define DMAC_CTRLA5			MMIO32(DMAC_BASE + 0x110)
/** DMAC_CTRLB5 DMAC Channel Control B Register (ch_num = 5) **/
#define DMAC_CTRLB5			MMIO32(DMAC_BASE + 0x114)
/** DMAC_CFG5 DMAC Channel Configuration Register (ch_num = 5) **/
#define DMAC_CFG5			MMIO32(DMAC_BASE + 0x118)
/** DMAC_WPMR DMAC Write Protect Mode Register **/
#define DMAC_WPMR			MMIO32(DMAC_BASE + 0x1e4)
/** DMAC_WPSR DMAC Write Protect Status Register **/
#define DMAC_WPSR			MMIO32(DMAC_BASE + 0x1e8)

/**@}*/


