grevaillot/svd_tools/headers/ATSAM3X8H/dmac.h
/** @defgroup dmac_gcfg GCFG DMAC Global Configuration Register
@{*/

/** DMAC_GCFG_ARB_CFG Arbiter Configuration **/
#define DMAC_GCFG_ARB_CFG		(1 << 4)

/**@}*/

/** @defgroup dmac_en EN DMAC Enable Register
@{*/

/** DMAC_EN_ENABLE General Enable of DMA **/
#define DMAC_EN_ENABLE		(1 << 0)

/**@}*/

/** @defgroup dmac_sreq SREQ DMAC Software Single Request Register
@{*/

/** DMAC_SREQ_DSREQ5 Destination Request **/
#define DMAC_SREQ_DSREQ5		(1 << 11)
/** DMAC_SREQ_SSREQ5 Source Request **/
#define DMAC_SREQ_SSREQ5		(1 << 10)
/** DMAC_SREQ_DSREQ4 Destination Request **/
#define DMAC_SREQ_DSREQ4		(1 << 9)
/** DMAC_SREQ_SSREQ4 Source Request **/
#define DMAC_SREQ_SSREQ4		(1 << 8)
/** DMAC_SREQ_DSREQ3 Destination Request **/
#define DMAC_SREQ_DSREQ3		(1 << 7)
/** DMAC_SREQ_SSREQ3 Source Request **/
#define DMAC_SREQ_SSREQ3		(1 << 6)
/** DMAC_SREQ_DSREQ2 Destination Request **/
#define DMAC_SREQ_DSREQ2		(1 << 5)
/** DMAC_SREQ_SSREQ2 Source Request **/
#define DMAC_SREQ_SSREQ2		(1 << 4)
/** DMAC_SREQ_DSREQ1 Destination Request **/
#define DMAC_SREQ_DSREQ1		(1 << 3)
/** DMAC_SREQ_SSREQ1 Source Request **/
#define DMAC_SREQ_SSREQ1		(1 << 2)
/** DMAC_SREQ_DSREQ0 Destination Request **/
#define DMAC_SREQ_DSREQ0		(1 << 1)
/** DMAC_SREQ_SSREQ0 Source Request **/
#define DMAC_SREQ_SSREQ0		(1 << 0)

/**@}*/

/** @defgroup dmac_creq CREQ DMAC Software Chunk Transfer Request Register
@{*/

/** DMAC_CREQ_DCREQ5 Destination Chunk Request **/
#define DMAC_CREQ_DCREQ5		(1 << 11)
/** DMAC_CREQ_SCREQ5 Source Chunk Request **/
#define DMAC_CREQ_SCREQ5		(1 << 10)
/** DMAC_CREQ_DCREQ4 Destination Chunk Request **/
#define DMAC_CREQ_DCREQ4		(1 << 9)
/** DMAC_CREQ_SCREQ4 Source Chunk Request **/
#define DMAC_CREQ_SCREQ4		(1 << 8)
/** DMAC_CREQ_DCREQ3 Destination Chunk Request **/
#define DMAC_CREQ_DCREQ3		(1 << 7)
/** DMAC_CREQ_SCREQ3 Source Chunk Request **/
#define DMAC_CREQ_SCREQ3		(1 << 6)
/** DMAC_CREQ_DCREQ2 Destination Chunk Request **/
#define DMAC_CREQ_DCREQ2		(1 << 5)
/** DMAC_CREQ_SCREQ2 Source Chunk Request **/
#define DMAC_CREQ_SCREQ2		(1 << 4)
/** DMAC_CREQ_DCREQ1 Destination Chunk Request **/
#define DMAC_CREQ_DCREQ1		(1 << 3)
/** DMAC_CREQ_SCREQ1 Source Chunk Request **/
#define DMAC_CREQ_SCREQ1		(1 << 2)
/** DMAC_CREQ_DCREQ0 Destination Chunk Request **/
#define DMAC_CREQ_DCREQ0		(1 << 1)
/** DMAC_CREQ_SCREQ0 Source Chunk Request **/
#define DMAC_CREQ_SCREQ0		(1 << 0)

/**@}*/

/** @defgroup dmac_last LAST DMAC Software Last Transfer Flag Register
@{*/

/** DMAC_LAST_DLAST5 Destination Last **/
#define DMAC_LAST_DLAST5		(1 << 11)
/** DMAC_LAST_SLAST5 Source Last **/
#define DMAC_LAST_SLAST5		(1 << 10)
/** DMAC_LAST_DLAST4 Destination Last **/
#define DMAC_LAST_DLAST4		(1 << 9)
/** DMAC_LAST_SLAST4 Source Last **/
#define DMAC_LAST_SLAST4		(1 << 8)
/** DMAC_LAST_DLAST3 Destination Last **/
#define DMAC_LAST_DLAST3		(1 << 7)
/** DMAC_LAST_SLAST3 Source Last **/
#define DMAC_LAST_SLAST3		(1 << 6)
/** DMAC_LAST_DLAST2 Destination Last **/
#define DMAC_LAST_DLAST2		(1 << 5)
/** DMAC_LAST_SLAST2 Source Last **/
#define DMAC_LAST_SLAST2		(1 << 4)
/** DMAC_LAST_DLAST1 Destination Last **/
#define DMAC_LAST_DLAST1		(1 << 3)
/** DMAC_LAST_SLAST1 Source Last **/
#define DMAC_LAST_SLAST1		(1 << 2)
/** DMAC_LAST_DLAST0 Destination Last **/
#define DMAC_LAST_DLAST0		(1 << 1)
/** DMAC_LAST_SLAST0 Source Last **/
#define DMAC_LAST_SLAST0		(1 << 0)

/**@}*/

/** @defgroup dmac_ebcier EBCIER DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Enable register.
@{*/

/** DMAC_EBCIER_ERR5 Access Error [5:0] **/
#define DMAC_EBCIER_ERR5		(1 << 21)
/** DMAC_EBCIER_ERR4 Access Error [5:0] **/
#define DMAC_EBCIER_ERR4		(1 << 20)
/** DMAC_EBCIER_ERR3 Access Error [5:0] **/
#define DMAC_EBCIER_ERR3		(1 << 19)
/** DMAC_EBCIER_ERR2 Access Error [5:0] **/
#define DMAC_EBCIER_ERR2		(1 << 18)
/** DMAC_EBCIER_ERR1 Access Error [5:0] **/
#define DMAC_EBCIER_ERR1		(1 << 17)
/** DMAC_EBCIER_ERR0 Access Error [5:0] **/
#define DMAC_EBCIER_ERR0		(1 << 16)
/** DMAC_EBCIER_CBTC5 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_CBTC5		(1 << 13)
/** DMAC_EBCIER_CBTC4 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_CBTC4		(1 << 12)
/** DMAC_EBCIER_CBTC3 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_CBTC3		(1 << 11)
/** DMAC_EBCIER_CBTC2 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_CBTC2		(1 << 10)
/** DMAC_EBCIER_CBTC1 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_CBTC1		(1 << 9)
/** DMAC_EBCIER_CBTC0 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_CBTC0		(1 << 8)
/** DMAC_EBCIER_BTC5 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_BTC5		(1 << 5)
/** DMAC_EBCIER_BTC4 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_BTC4		(1 << 4)
/** DMAC_EBCIER_BTC3 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_BTC3		(1 << 3)
/** DMAC_EBCIER_BTC2 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_BTC2		(1 << 2)
/** DMAC_EBCIER_BTC1 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_BTC1		(1 << 1)
/** DMAC_EBCIER_BTC0 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIER_BTC0		(1 << 0)

/**@}*/

/** @defgroup dmac_ebcidr EBCIDR DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer Transfer Completed Interrupt Disable register.
@{*/

/** DMAC_EBCIDR_ERR5 Access Error [5:0] **/
#define DMAC_EBCIDR_ERR5		(1 << 21)
/** DMAC_EBCIDR_ERR4 Access Error [5:0] **/
#define DMAC_EBCIDR_ERR4		(1 << 20)
/** DMAC_EBCIDR_ERR3 Access Error [5:0] **/
#define DMAC_EBCIDR_ERR3		(1 << 19)
/** DMAC_EBCIDR_ERR2 Access Error [5:0] **/
#define DMAC_EBCIDR_ERR2		(1 << 18)
/** DMAC_EBCIDR_ERR1 Access Error [5:0] **/
#define DMAC_EBCIDR_ERR1		(1 << 17)
/** DMAC_EBCIDR_ERR0 Access Error [5:0] **/
#define DMAC_EBCIDR_ERR0		(1 << 16)
/** DMAC_EBCIDR_CBTC5 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_CBTC5		(1 << 13)
/** DMAC_EBCIDR_CBTC4 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_CBTC4		(1 << 12)
/** DMAC_EBCIDR_CBTC3 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_CBTC3		(1 << 11)
/** DMAC_EBCIDR_CBTC2 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_CBTC2		(1 << 10)
/** DMAC_EBCIDR_CBTC1 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_CBTC1		(1 << 9)
/** DMAC_EBCIDR_CBTC0 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_CBTC0		(1 << 8)
/** DMAC_EBCIDR_BTC5 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_BTC5		(1 << 5)
/** DMAC_EBCIDR_BTC4 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_BTC4		(1 << 4)
/** DMAC_EBCIDR_BTC3 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_BTC3		(1 << 3)
/** DMAC_EBCIDR_BTC2 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_BTC2		(1 << 2)
/** DMAC_EBCIDR_BTC1 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_BTC1		(1 << 1)
/** DMAC_EBCIDR_BTC0 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIDR_BTC0		(1 << 0)

/**@}*/

