grevaillot/svd_tools/headers/ATSAM3X8H/dmac.h
/** @defgroup dmac_ebcimr EBCIMR DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer transfer completed Mask Register.
@{*/

/** DMAC_EBCIMR_ERR5 Access Error [5:0] **/
#define DMAC_EBCIMR_ERR5		(1 << 21)
/** DMAC_EBCIMR_ERR4 Access Error [5:0] **/
#define DMAC_EBCIMR_ERR4		(1 << 20)
/** DMAC_EBCIMR_ERR3 Access Error [5:0] **/
#define DMAC_EBCIMR_ERR3		(1 << 19)
/** DMAC_EBCIMR_ERR2 Access Error [5:0] **/
#define DMAC_EBCIMR_ERR2		(1 << 18)
/** DMAC_EBCIMR_ERR1 Access Error [5:0] **/
#define DMAC_EBCIMR_ERR1		(1 << 17)
/** DMAC_EBCIMR_ERR0 Access Error [5:0] **/
#define DMAC_EBCIMR_ERR0		(1 << 16)
/** DMAC_EBCIMR_CBTC5 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_CBTC5		(1 << 13)
/** DMAC_EBCIMR_CBTC4 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_CBTC4		(1 << 12)
/** DMAC_EBCIMR_CBTC3 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_CBTC3		(1 << 11)
/** DMAC_EBCIMR_CBTC2 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_CBTC2		(1 << 10)
/** DMAC_EBCIMR_CBTC1 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_CBTC1		(1 << 9)
/** DMAC_EBCIMR_CBTC0 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_CBTC0		(1 << 8)
/** DMAC_EBCIMR_BTC5 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_BTC5		(1 << 5)
/** DMAC_EBCIMR_BTC4 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_BTC4		(1 << 4)
/** DMAC_EBCIMR_BTC3 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_BTC3		(1 << 3)
/** DMAC_EBCIMR_BTC2 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_BTC2		(1 << 2)
/** DMAC_EBCIMR_BTC1 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_BTC1		(1 << 1)
/** DMAC_EBCIMR_BTC0 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCIMR_BTC0		(1 << 0)

/**@}*/

/** @defgroup dmac_ebcisr EBCISR DMAC Error, Chained Buffer Transfer Completed Interrupt and Buffer transfer completed Status Register.
@{*/

/** DMAC_EBCISR_ERR5 Access Error [5:0] **/
#define DMAC_EBCISR_ERR5		(1 << 21)
/** DMAC_EBCISR_ERR4 Access Error [5:0] **/
#define DMAC_EBCISR_ERR4		(1 << 20)
/** DMAC_EBCISR_ERR3 Access Error [5:0] **/
#define DMAC_EBCISR_ERR3		(1 << 19)
/** DMAC_EBCISR_ERR2 Access Error [5:0] **/
#define DMAC_EBCISR_ERR2		(1 << 18)
/** DMAC_EBCISR_ERR1 Access Error [5:0] **/
#define DMAC_EBCISR_ERR1		(1 << 17)
/** DMAC_EBCISR_ERR0 Access Error [5:0] **/
#define DMAC_EBCISR_ERR0		(1 << 16)
/** DMAC_EBCISR_CBTC5 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_CBTC5		(1 << 13)
/** DMAC_EBCISR_CBTC4 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_CBTC4		(1 << 12)
/** DMAC_EBCISR_CBTC3 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_CBTC3		(1 << 11)
/** DMAC_EBCISR_CBTC2 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_CBTC2		(1 << 10)
/** DMAC_EBCISR_CBTC1 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_CBTC1		(1 << 9)
/** DMAC_EBCISR_CBTC0 Chained Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_CBTC0		(1 << 8)
/** DMAC_EBCISR_BTC5 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_BTC5		(1 << 5)
/** DMAC_EBCISR_BTC4 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_BTC4		(1 << 4)
/** DMAC_EBCISR_BTC3 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_BTC3		(1 << 3)
/** DMAC_EBCISR_BTC2 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_BTC2		(1 << 2)
/** DMAC_EBCISR_BTC1 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_BTC1		(1 << 1)
/** DMAC_EBCISR_BTC0 Buffer Transfer Completed [5:0] **/
#define DMAC_EBCISR_BTC0		(1 << 0)

/**@}*/

/** @defgroup dmac_cher CHER DMAC Channel Handler Enable Register
@{*/

/** DMAC_CHER_KEEP5 Keep on [5:0] **/
#define DMAC_CHER_KEEP5		(1 << 29)
/** DMAC_CHER_KEEP4 Keep on [5:0] **/
#define DMAC_CHER_KEEP4		(1 << 28)
/** DMAC_CHER_KEEP3 Keep on [5:0] **/
#define DMAC_CHER_KEEP3		(1 << 27)
/** DMAC_CHER_KEEP2 Keep on [5:0] **/
#define DMAC_CHER_KEEP2		(1 << 26)
/** DMAC_CHER_KEEP1 Keep on [5:0] **/
#define DMAC_CHER_KEEP1		(1 << 25)
/** DMAC_CHER_KEEP0 Keep on [5:0] **/
#define DMAC_CHER_KEEP0		(1 << 24)
/** DMAC_CHER_SUSP5 Suspend [5:0] **/
#define DMAC_CHER_SUSP5		(1 << 13)
/** DMAC_CHER_SUSP4 Suspend [5:0] **/
#define DMAC_CHER_SUSP4		(1 << 12)
/** DMAC_CHER_SUSP3 Suspend [5:0] **/
#define DMAC_CHER_SUSP3		(1 << 11)
/** DMAC_CHER_SUSP2 Suspend [5:0] **/
#define DMAC_CHER_SUSP2		(1 << 10)
/** DMAC_CHER_SUSP1 Suspend [5:0] **/
#define DMAC_CHER_SUSP1		(1 << 9)
/** DMAC_CHER_SUSP0 Suspend [5:0] **/
#define DMAC_CHER_SUSP0		(1 << 8)
/** DMAC_CHER_ENA5 Enable [5:0] **/
#define DMAC_CHER_ENA5		(1 << 5)
/** DMAC_CHER_ENA4 Enable [5:0] **/
#define DMAC_CHER_ENA4		(1 << 4)
/** DMAC_CHER_ENA3 Enable [5:0] **/
#define DMAC_CHER_ENA3		(1 << 3)
/** DMAC_CHER_ENA2 Enable [5:0] **/
#define DMAC_CHER_ENA2		(1 << 2)
/** DMAC_CHER_ENA1 Enable [5:0] **/
#define DMAC_CHER_ENA1		(1 << 1)
/** DMAC_CHER_ENA0 Enable [5:0] **/
#define DMAC_CHER_ENA0		(1 << 0)

/**@}*/

/** @defgroup dmac_chdr CHDR DMAC Channel Handler Disable Register
@{*/

/** DMAC_CHDR_RES5 Resume [5:0] **/
#define DMAC_CHDR_RES5		(1 << 13)
/** DMAC_CHDR_RES4 Resume [5:0] **/
#define DMAC_CHDR_RES4		(1 << 12)
/** DMAC_CHDR_RES3 Resume [5:0] **/
#define DMAC_CHDR_RES3		(1 << 11)
/** DMAC_CHDR_RES2 Resume [5:0] **/
#define DMAC_CHDR_RES2		(1 << 10)
/** DMAC_CHDR_RES1 Resume [5:0] **/
#define DMAC_CHDR_RES1		(1 << 9)
/** DMAC_CHDR_RES0 Resume [5:0] **/
#define DMAC_CHDR_RES0		(1 << 8)
/** DMAC_CHDR_DIS5 Disable [5:0] **/
#define DMAC_CHDR_DIS5		(1 << 5)
/** DMAC_CHDR_DIS4 Disable [5:0] **/
#define DMAC_CHDR_DIS4		(1 << 4)
/** DMAC_CHDR_DIS3 Disable [5:0] **/
#define DMAC_CHDR_DIS3		(1 << 3)
/** DMAC_CHDR_DIS2 Disable [5:0] **/
#define DMAC_CHDR_DIS2		(1 << 2)
/** DMAC_CHDR_DIS1 Disable [5:0] **/
#define DMAC_CHDR_DIS1		(1 << 1)
/** DMAC_CHDR_DIS0 Disable [5:0] **/
#define DMAC_CHDR_DIS0		(1 << 0)

/**@}*/

/** @defgroup dmac_chsr CHSR DMAC Channel Handler Status Register
@{*/

/** DMAC_CHSR_STAL5 Stalled [5:0] **/
#define DMAC_CHSR_STAL5		(1 << 29)
/** DMAC_CHSR_STAL4 Stalled [5:0] **/
#define DMAC_CHSR_STAL4		(1 << 28)
/** DMAC_CHSR_STAL3 Stalled [5:0] **/
#define DMAC_CHSR_STAL3		(1 << 27)
/** DMAC_CHSR_STAL2 Stalled [5:0] **/
#define DMAC_CHSR_STAL2		(1 << 26)
/** DMAC_CHSR_STAL1 Stalled [5:0] **/
#define DMAC_CHSR_STAL1		(1 << 25)
/** DMAC_CHSR_STAL0 Stalled [5:0] **/
#define DMAC_CHSR_STAL0		(1 << 24)
/** DMAC_CHSR_EMPT5 Empty [5:0] **/
#define DMAC_CHSR_EMPT5		(1 << 21)
/** DMAC_CHSR_EMPT4 Empty [5:0] **/
#define DMAC_CHSR_EMPT4		(1 << 20)
/** DMAC_CHSR_EMPT3 Empty [5:0] **/
#define DMAC_CHSR_EMPT3		(1 << 19)
/** DMAC_CHSR_EMPT2 Empty [5:0] **/
#define DMAC_CHSR_EMPT2		(1 << 18)
/** DMAC_CHSR_EMPT1 Empty [5:0] **/
#define DMAC_CHSR_EMPT1		(1 << 17)
/** DMAC_CHSR_EMPT0 Empty [5:0] **/
#define DMAC_CHSR_EMPT0		(1 << 16)
/** DMAC_CHSR_SUSP5 Suspend [5:0] **/
#define DMAC_CHSR_SUSP5		(1 << 13)
/** DMAC_CHSR_SUSP4 Suspend [5:0] **/
#define DMAC_CHSR_SUSP4		(1 << 12)
/** DMAC_CHSR_SUSP3 Suspend [5:0] **/
#define DMAC_CHSR_SUSP3		(1 << 11)
/** DMAC_CHSR_SUSP2 Suspend [5:0] **/
#define DMAC_CHSR_SUSP2		(1 << 10)
/** DMAC_CHSR_SUSP1 Suspend [5:0] **/
#define DMAC_CHSR_SUSP1		(1 << 9)
/** DMAC_CHSR_SUSP0 Suspend [5:0] **/
#define DMAC_CHSR_SUSP0		(1 << 8)
/** DMAC_CHSR_ENA5 Enable [5:0] **/
#define DMAC_CHSR_ENA5		(1 << 5)
/** DMAC_CHSR_ENA4 Enable [5:0] **/
#define DMAC_CHSR_ENA4		(1 << 4)
/** DMAC_CHSR_ENA3 Enable [5:0] **/
#define DMAC_CHSR_ENA3		(1 << 3)
/** DMAC_CHSR_ENA2 Enable [5:0] **/
#define DMAC_CHSR_ENA2		(1 << 2)
/** DMAC_CHSR_ENA1 Enable [5:0] **/
#define DMAC_CHSR_ENA1		(1 << 1)
/** DMAC_CHSR_ENA0 Enable [5:0] **/
#define DMAC_CHSR_ENA0		(1 << 0)

/**@}*/

