grevaillot/svd_tools/headers/ATSAM3X8H/dmac.h
/** @defgroup dmac_saddr0 SADDR0 DMAC Channel Source Address Register (ch_num = 0)
@{*/


#define DMAC_SADDR0_SADDR_SHIFT		0
#define DMAC_SADDR0_SADDR_MASK		0xffffffff
/** @defgroup dmac_saddr0_saddr SADDR Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_daddr0 DADDR0 DMAC Channel Destination Address Register (ch_num = 0)
@{*/


#define DMAC_DADDR0_DADDR_SHIFT		0
#define DMAC_DADDR0_DADDR_MASK		0xffffffff
/** @defgroup dmac_daddr0_daddr DADDR Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_dscr0 DSCR0 DMAC Channel Descriptor Address Register (ch_num = 0)
@{*/


#define DMAC_DSCR0_DSCR_SHIFT		2
#define DMAC_DSCR0_DSCR_MASK		0x3fffffff
/** @defgroup dmac_dscr0_dscr DSCR Buffer Transfer Descriptor Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrla0 CTRLA0 DMAC Channel Control A Register (ch_num = 0)
@{*/

/** DMAC_CTRLA0_DONE Current Descriptor Stop Command and Transfer Completed Memory Indicator **/
#define DMAC_CTRLA0_DONE		(1 << 31)

#define DMAC_CTRLA0_DST_WIDTH_SHIFT		28
#define DMAC_CTRLA0_DST_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla0_dst_width DSTWIDTH Transfer Width for the Destination
@{*/
/**@}*/


#define DMAC_CTRLA0_SRC_WIDTH_SHIFT		24
#define DMAC_CTRLA0_SRC_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla0_src_width SRCWIDTH Transfer Width for the Source
@{*/
/**@}*/


#define DMAC_CTRLA0_DCSIZE_SHIFT		20
#define DMAC_CTRLA0_DCSIZE_MASK		0x07
/** @defgroup dmac_ctrla0_dcsize DCSIZE Destination Chunk Transfer Size
@{*/
/**@}*/


#define DMAC_CTRLA0_SCSIZE_SHIFT		16
#define DMAC_CTRLA0_SCSIZE_MASK		0x07
/** @defgroup dmac_ctrla0_scsize SCSIZE Source Chunk Transfer Size.
@{*/
/**@}*/


#define DMAC_CTRLA0_BTSIZE_SHIFT		0
#define DMAC_CTRLA0_BTSIZE_MASK		0xffff
/** @defgroup dmac_ctrla0_btsize BTSIZE Buffer Transfer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrlb0 CTRLB0 DMAC Channel Control B Register (ch_num = 0)
@{*/

/** DMAC_CTRLB0_IEN Interrupt Enable Not **/
#define DMAC_CTRLB0_IEN		(1 << 30)

#define DMAC_CTRLB0_DST_INCR_SHIFT		28
#define DMAC_CTRLB0_DST_INCR_MASK		0x03
/** @defgroup dmac_ctrlb0_dst_incr DSTINCR Incrementing, Decrementing or Fixed Address for the Destination
@{*/
/**@}*/


#define DMAC_CTRLB0_SRC_INCR_SHIFT		24
#define DMAC_CTRLB0_SRC_INCR_MASK		0x03
/** @defgroup dmac_ctrlb0_src_incr SRCINCR Incrementing, Decrementing or Fixed Address for the Source
@{*/
/**@}*/


#define DMAC_CTRLB0_FC_SHIFT		21
#define DMAC_CTRLB0_FC_MASK		0x03
/** @defgroup dmac_ctrlb0_fc FC Flow Control
@{*/
/**@}*/

/** DMAC_CTRLB0_DST_DSCR Destination Address Descriptor **/
#define DMAC_CTRLB0_DST_DSCR		(1 << 20)
/** DMAC_CTRLB0_SRC_DSCR Source Address Descriptor **/
#define DMAC_CTRLB0_SRC_DSCR		(1 << 16)

/**@}*/

/** @defgroup dmac_cfg0 CFG0 DMAC Channel Configuration Register (ch_num = 0)
@{*/


#define DMAC_CFG0_FIFOCFG_SHIFT		28
#define DMAC_CFG0_FIFOCFG_MASK		0x03
/** @defgroup dmac_cfg0_fifocfg FIFOCFG FIFO Configuration
@{*/
/**@}*/


#define DMAC_CFG0_AHB_PROT_SHIFT		24
#define DMAC_CFG0_AHB_PROT_MASK		0x07
/** @defgroup dmac_cfg0_ahb_prot AHBPROT AHB Protection
@{*/
/**@}*/

/** DMAC_CFG0_LOCK_IF_L Master Interface Arbiter Lock **/
#define DMAC_CFG0_LOCK_IF_L		(1 << 22)
/** DMAC_CFG0_LOCK_B Bus Lock **/
#define DMAC_CFG0_LOCK_B		(1 << 21)
/** DMAC_CFG0_LOCK_IF Interface Lock **/
#define DMAC_CFG0_LOCK_IF		(1 << 20)
/** DMAC_CFG0_SOD Stop On Done **/
#define DMAC_CFG0_SOD		(1 << 16)
/** DMAC_CFG0_DST_H2SEL Software or Hardware Selection for the Destination **/
#define DMAC_CFG0_DST_H2SEL		(1 << 13)
/** DMAC_CFG0_SRC_H2SEL Software or Hardware Selection for the Source **/
#define DMAC_CFG0_SRC_H2SEL		(1 << 9)

#define DMAC_CFG0_DST_PER_SHIFT		4
#define DMAC_CFG0_DST_PER_MASK		0x0f
/** @defgroup dmac_cfg0_dst_per DSTPER Destination with Peripheral identifier
@{*/
/**@}*/


#define DMAC_CFG0_SRC_PER_SHIFT		0
#define DMAC_CFG0_SRC_PER_MASK		0x0f
/** @defgroup dmac_cfg0_src_per SRCPER Source with Peripheral identifier
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_saddr1 SADDR1 DMAC Channel Source Address Register (ch_num = 1)
@{*/


#define DMAC_SADDR1_SADDR_SHIFT		0
#define DMAC_SADDR1_SADDR_MASK		0xffffffff
/** @defgroup dmac_saddr1_saddr SADDR Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_daddr1 DADDR1 DMAC Channel Destination Address Register (ch_num = 1)
@{*/


#define DMAC_DADDR1_DADDR_SHIFT		0
#define DMAC_DADDR1_DADDR_MASK		0xffffffff
/** @defgroup dmac_daddr1_daddr DADDR Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_dscr1 DSCR1 DMAC Channel Descriptor Address Register (ch_num = 1)
@{*/


#define DMAC_DSCR1_DSCR_SHIFT		2
#define DMAC_DSCR1_DSCR_MASK		0x3fffffff
/** @defgroup dmac_dscr1_dscr DSCR Buffer Transfer Descriptor Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrla1 CTRLA1 DMAC Channel Control A Register (ch_num = 1)
@{*/

/** DMAC_CTRLA1_DONE Current Descriptor Stop Command and Transfer Completed Memory Indicator **/
#define DMAC_CTRLA1_DONE		(1 << 31)

#define DMAC_CTRLA1_DST_WIDTH_SHIFT		28
#define DMAC_CTRLA1_DST_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla1_dst_width DSTWIDTH Transfer Width for the Destination
@{*/
/**@}*/


#define DMAC_CTRLA1_SRC_WIDTH_SHIFT		24
#define DMAC_CTRLA1_SRC_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla1_src_width SRCWIDTH Transfer Width for the Source
@{*/
/**@}*/


#define DMAC_CTRLA1_DCSIZE_SHIFT		20
#define DMAC_CTRLA1_DCSIZE_MASK		0x07
/** @defgroup dmac_ctrla1_dcsize DCSIZE Destination Chunk Transfer Size
@{*/
/**@}*/


#define DMAC_CTRLA1_SCSIZE_SHIFT		16
#define DMAC_CTRLA1_SCSIZE_MASK		0x07
/** @defgroup dmac_ctrla1_scsize SCSIZE Source Chunk Transfer Size.
@{*/
/**@}*/


#define DMAC_CTRLA1_BTSIZE_SHIFT		0
#define DMAC_CTRLA1_BTSIZE_MASK		0xffff
/** @defgroup dmac_ctrla1_btsize BTSIZE Buffer Transfer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrlb1 CTRLB1 DMAC Channel Control B Register (ch_num = 1)
@{*/

/** DMAC_CTRLB1_IEN Interrupt Enable Not **/
#define DMAC_CTRLB1_IEN		(1 << 30)

#define DMAC_CTRLB1_DST_INCR_SHIFT		28
#define DMAC_CTRLB1_DST_INCR_MASK		0x03
/** @defgroup dmac_ctrlb1_dst_incr DSTINCR Incrementing, Decrementing or Fixed Address for the Destination
@{*/
/**@}*/


#define DMAC_CTRLB1_SRC_INCR_SHIFT		24
#define DMAC_CTRLB1_SRC_INCR_MASK		0x03
/** @defgroup dmac_ctrlb1_src_incr SRCINCR Incrementing, Decrementing or Fixed Address for the Source
@{*/
/**@}*/


