grevaillot/svd_tools/headers/ATSAM3X8H/dmac.h
#define DMAC_CTRLB1_FC_SHIFT		21
#define DMAC_CTRLB1_FC_MASK		0x03
/** @defgroup dmac_ctrlb1_fc FC Flow Control
@{*/
/**@}*/

/** DMAC_CTRLB1_DST_DSCR Destination Address Descriptor **/
#define DMAC_CTRLB1_DST_DSCR		(1 << 20)
/** DMAC_CTRLB1_SRC_DSCR Source Address Descriptor **/
#define DMAC_CTRLB1_SRC_DSCR		(1 << 16)

/**@}*/

/** @defgroup dmac_cfg1 CFG1 DMAC Channel Configuration Register (ch_num = 1)
@{*/


#define DMAC_CFG1_FIFOCFG_SHIFT		28
#define DMAC_CFG1_FIFOCFG_MASK		0x03
/** @defgroup dmac_cfg1_fifocfg FIFOCFG FIFO Configuration
@{*/
/**@}*/


#define DMAC_CFG1_AHB_PROT_SHIFT		24
#define DMAC_CFG1_AHB_PROT_MASK		0x07
/** @defgroup dmac_cfg1_ahb_prot AHBPROT AHB Protection
@{*/
/**@}*/

/** DMAC_CFG1_LOCK_IF_L Master Interface Arbiter Lock **/
#define DMAC_CFG1_LOCK_IF_L		(1 << 22)
/** DMAC_CFG1_LOCK_B Bus Lock **/
#define DMAC_CFG1_LOCK_B		(1 << 21)
/** DMAC_CFG1_LOCK_IF Interface Lock **/
#define DMAC_CFG1_LOCK_IF		(1 << 20)
/** DMAC_CFG1_SOD Stop On Done **/
#define DMAC_CFG1_SOD		(1 << 16)
/** DMAC_CFG1_DST_H2SEL Software or Hardware Selection for the Destination **/
#define DMAC_CFG1_DST_H2SEL		(1 << 13)
/** DMAC_CFG1_SRC_H2SEL Software or Hardware Selection for the Source **/
#define DMAC_CFG1_SRC_H2SEL		(1 << 9)

#define DMAC_CFG1_DST_PER_SHIFT		4
#define DMAC_CFG1_DST_PER_MASK		0x0f
/** @defgroup dmac_cfg1_dst_per DSTPER Destination with Peripheral identifier
@{*/
/**@}*/


#define DMAC_CFG1_SRC_PER_SHIFT		0
#define DMAC_CFG1_SRC_PER_MASK		0x0f
/** @defgroup dmac_cfg1_src_per SRCPER Source with Peripheral identifier
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_saddr2 SADDR2 DMAC Channel Source Address Register (ch_num = 2)
@{*/


#define DMAC_SADDR2_SADDR_SHIFT		0
#define DMAC_SADDR2_SADDR_MASK		0xffffffff
/** @defgroup dmac_saddr2_saddr SADDR Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_daddr2 DADDR2 DMAC Channel Destination Address Register (ch_num = 2)
@{*/


#define DMAC_DADDR2_DADDR_SHIFT		0
#define DMAC_DADDR2_DADDR_MASK		0xffffffff
/** @defgroup dmac_daddr2_daddr DADDR Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_dscr2 DSCR2 DMAC Channel Descriptor Address Register (ch_num = 2)
@{*/


#define DMAC_DSCR2_DSCR_SHIFT		2
#define DMAC_DSCR2_DSCR_MASK		0x3fffffff
/** @defgroup dmac_dscr2_dscr DSCR Buffer Transfer Descriptor Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrla2 CTRLA2 DMAC Channel Control A Register (ch_num = 2)
@{*/

/** DMAC_CTRLA2_DONE Current Descriptor Stop Command and Transfer Completed Memory Indicator **/
#define DMAC_CTRLA2_DONE		(1 << 31)

#define DMAC_CTRLA2_DST_WIDTH_SHIFT		28
#define DMAC_CTRLA2_DST_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla2_dst_width DSTWIDTH Transfer Width for the Destination
@{*/
/**@}*/


#define DMAC_CTRLA2_SRC_WIDTH_SHIFT		24
#define DMAC_CTRLA2_SRC_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla2_src_width SRCWIDTH Transfer Width for the Source
@{*/
/**@}*/


#define DMAC_CTRLA2_DCSIZE_SHIFT		20
#define DMAC_CTRLA2_DCSIZE_MASK		0x07
/** @defgroup dmac_ctrla2_dcsize DCSIZE Destination Chunk Transfer Size
@{*/
/**@}*/


#define DMAC_CTRLA2_SCSIZE_SHIFT		16
#define DMAC_CTRLA2_SCSIZE_MASK		0x07
/** @defgroup dmac_ctrla2_scsize SCSIZE Source Chunk Transfer Size.
@{*/
/**@}*/


#define DMAC_CTRLA2_BTSIZE_SHIFT		0
#define DMAC_CTRLA2_BTSIZE_MASK		0xffff
/** @defgroup dmac_ctrla2_btsize BTSIZE Buffer Transfer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrlb2 CTRLB2 DMAC Channel Control B Register (ch_num = 2)
@{*/

/** DMAC_CTRLB2_IEN Interrupt Enable Not **/
#define DMAC_CTRLB2_IEN		(1 << 30)

#define DMAC_CTRLB2_DST_INCR_SHIFT		28
#define DMAC_CTRLB2_DST_INCR_MASK		0x03
/** @defgroup dmac_ctrlb2_dst_incr DSTINCR Incrementing, Decrementing or Fixed Address for the Destination
@{*/
/**@}*/


#define DMAC_CTRLB2_SRC_INCR_SHIFT		24
#define DMAC_CTRLB2_SRC_INCR_MASK		0x03
/** @defgroup dmac_ctrlb2_src_incr SRCINCR Incrementing, Decrementing or Fixed Address for the Source
@{*/
/**@}*/


#define DMAC_CTRLB2_FC_SHIFT		21
#define DMAC_CTRLB2_FC_MASK		0x03
/** @defgroup dmac_ctrlb2_fc FC Flow Control
@{*/
/**@}*/

/** DMAC_CTRLB2_DST_DSCR Destination Address Descriptor **/
#define DMAC_CTRLB2_DST_DSCR		(1 << 20)
/** DMAC_CTRLB2_SRC_DSCR Source Address Descriptor **/
#define DMAC_CTRLB2_SRC_DSCR		(1 << 16)

/**@}*/

/** @defgroup dmac_cfg2 CFG2 DMAC Channel Configuration Register (ch_num = 2)
@{*/


#define DMAC_CFG2_FIFOCFG_SHIFT		28
#define DMAC_CFG2_FIFOCFG_MASK		0x03
/** @defgroup dmac_cfg2_fifocfg FIFOCFG FIFO Configuration
@{*/
/**@}*/


#define DMAC_CFG2_AHB_PROT_SHIFT		24
#define DMAC_CFG2_AHB_PROT_MASK		0x07
/** @defgroup dmac_cfg2_ahb_prot AHBPROT AHB Protection
@{*/
/**@}*/

/** DMAC_CFG2_LOCK_IF_L Master Interface Arbiter Lock **/
#define DMAC_CFG2_LOCK_IF_L		(1 << 22)
/** DMAC_CFG2_LOCK_B Bus Lock **/
#define DMAC_CFG2_LOCK_B		(1 << 21)
/** DMAC_CFG2_LOCK_IF Interface Lock **/
#define DMAC_CFG2_LOCK_IF		(1 << 20)
/** DMAC_CFG2_SOD Stop On Done **/
#define DMAC_CFG2_SOD		(1 << 16)
/** DMAC_CFG2_DST_H2SEL Software or Hardware Selection for the Destination **/
#define DMAC_CFG2_DST_H2SEL		(1 << 13)
/** DMAC_CFG2_SRC_H2SEL Software or Hardware Selection for the Source **/
#define DMAC_CFG2_SRC_H2SEL		(1 << 9)

#define DMAC_CFG2_DST_PER_SHIFT		4
#define DMAC_CFG2_DST_PER_MASK		0x0f
/** @defgroup dmac_cfg2_dst_per DSTPER Destination with Peripheral identifier
@{*/
/**@}*/


#define DMAC_CFG2_SRC_PER_SHIFT		0
#define DMAC_CFG2_SRC_PER_MASK		0x0f
/** @defgroup dmac_cfg2_src_per SRCPER Source with Peripheral identifier
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_saddr3 SADDR3 DMAC Channel Source Address Register (ch_num = 3)
@{*/


#define DMAC_SADDR3_SADDR_SHIFT		0
#define DMAC_SADDR3_SADDR_MASK		0xffffffff
/** @defgroup dmac_saddr3_saddr SADDR Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_daddr3 DADDR3 DMAC Channel Destination Address Register (ch_num = 3)
@{*/


#define DMAC_DADDR3_DADDR_SHIFT		0
#define DMAC_DADDR3_DADDR_MASK		0xffffffff
/** @defgroup dmac_daddr3_daddr DADDR Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_dscr3 DSCR3 DMAC Channel Descriptor Address Register (ch_num = 3)
@{*/


#define DMAC_DSCR3_DSCR_SHIFT		2
#define DMAC_DSCR3_DSCR_MASK		0x3fffffff
/** @defgroup dmac_dscr3_dscr DSCR Buffer Transfer Descriptor Address
@{*/
/**@}*/


/**@}*/

