grevaillot/svd_tools/headers/ATSAM3X8H/dmac.h
/** @defgroup dmac_ctrla3 CTRLA3 DMAC Channel Control A Register (ch_num = 3)
@{*/

/** DMAC_CTRLA3_DONE Current Descriptor Stop Command and Transfer Completed Memory Indicator **/
#define DMAC_CTRLA3_DONE		(1 << 31)

#define DMAC_CTRLA3_DST_WIDTH_SHIFT		28
#define DMAC_CTRLA3_DST_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla3_dst_width DSTWIDTH Transfer Width for the Destination
@{*/
/**@}*/


#define DMAC_CTRLA3_SRC_WIDTH_SHIFT		24
#define DMAC_CTRLA3_SRC_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla3_src_width SRCWIDTH Transfer Width for the Source
@{*/
/**@}*/


#define DMAC_CTRLA3_DCSIZE_SHIFT		20
#define DMAC_CTRLA3_DCSIZE_MASK		0x07
/** @defgroup dmac_ctrla3_dcsize DCSIZE Destination Chunk Transfer Size
@{*/
/**@}*/


#define DMAC_CTRLA3_SCSIZE_SHIFT		16
#define DMAC_CTRLA3_SCSIZE_MASK		0x07
/** @defgroup dmac_ctrla3_scsize SCSIZE Source Chunk Transfer Size.
@{*/
/**@}*/


#define DMAC_CTRLA3_BTSIZE_SHIFT		0
#define DMAC_CTRLA3_BTSIZE_MASK		0xffff
/** @defgroup dmac_ctrla3_btsize BTSIZE Buffer Transfer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrlb3 CTRLB3 DMAC Channel Control B Register (ch_num = 3)
@{*/

/** DMAC_CTRLB3_IEN Interrupt Enable Not **/
#define DMAC_CTRLB3_IEN		(1 << 30)

#define DMAC_CTRLB3_DST_INCR_SHIFT		28
#define DMAC_CTRLB3_DST_INCR_MASK		0x03
/** @defgroup dmac_ctrlb3_dst_incr DSTINCR Incrementing, Decrementing or Fixed Address for the Destination
@{*/
/**@}*/


#define DMAC_CTRLB3_SRC_INCR_SHIFT		24
#define DMAC_CTRLB3_SRC_INCR_MASK		0x03
/** @defgroup dmac_ctrlb3_src_incr SRCINCR Incrementing, Decrementing or Fixed Address for the Source
@{*/
/**@}*/


#define DMAC_CTRLB3_FC_SHIFT		21
#define DMAC_CTRLB3_FC_MASK		0x03
/** @defgroup dmac_ctrlb3_fc FC Flow Control
@{*/
/**@}*/

/** DMAC_CTRLB3_DST_DSCR Destination Address Descriptor **/
#define DMAC_CTRLB3_DST_DSCR		(1 << 20)
/** DMAC_CTRLB3_SRC_DSCR Source Address Descriptor **/
#define DMAC_CTRLB3_SRC_DSCR		(1 << 16)

/**@}*/

/** @defgroup dmac_cfg3 CFG3 DMAC Channel Configuration Register (ch_num = 3)
@{*/


#define DMAC_CFG3_FIFOCFG_SHIFT		28
#define DMAC_CFG3_FIFOCFG_MASK		0x03
/** @defgroup dmac_cfg3_fifocfg FIFOCFG FIFO Configuration
@{*/
/**@}*/


#define DMAC_CFG3_AHB_PROT_SHIFT		24
#define DMAC_CFG3_AHB_PROT_MASK		0x07
/** @defgroup dmac_cfg3_ahb_prot AHBPROT AHB Protection
@{*/
/**@}*/

/** DMAC_CFG3_LOCK_IF_L Master Interface Arbiter Lock **/
#define DMAC_CFG3_LOCK_IF_L		(1 << 22)
/** DMAC_CFG3_LOCK_B Bus Lock **/
#define DMAC_CFG3_LOCK_B		(1 << 21)
/** DMAC_CFG3_LOCK_IF Interface Lock **/
#define DMAC_CFG3_LOCK_IF		(1 << 20)
/** DMAC_CFG3_SOD Stop On Done **/
#define DMAC_CFG3_SOD		(1 << 16)
/** DMAC_CFG3_DST_H2SEL Software or Hardware Selection for the Destination **/
#define DMAC_CFG3_DST_H2SEL		(1 << 13)
/** DMAC_CFG3_SRC_H2SEL Software or Hardware Selection for the Source **/
#define DMAC_CFG3_SRC_H2SEL		(1 << 9)

#define DMAC_CFG3_DST_PER_SHIFT		4
#define DMAC_CFG3_DST_PER_MASK		0x0f
/** @defgroup dmac_cfg3_dst_per DSTPER Destination with Peripheral identifier
@{*/
/**@}*/


#define DMAC_CFG3_SRC_PER_SHIFT		0
#define DMAC_CFG3_SRC_PER_MASK		0x0f
/** @defgroup dmac_cfg3_src_per SRCPER Source with Peripheral identifier
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_saddr4 SADDR4 DMAC Channel Source Address Register (ch_num = 4)
@{*/


#define DMAC_SADDR4_SADDR_SHIFT		0
#define DMAC_SADDR4_SADDR_MASK		0xffffffff
/** @defgroup dmac_saddr4_saddr SADDR Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_daddr4 DADDR4 DMAC Channel Destination Address Register (ch_num = 4)
@{*/


#define DMAC_DADDR4_DADDR_SHIFT		0
#define DMAC_DADDR4_DADDR_MASK		0xffffffff
/** @defgroup dmac_daddr4_daddr DADDR Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_dscr4 DSCR4 DMAC Channel Descriptor Address Register (ch_num = 4)
@{*/


#define DMAC_DSCR4_DSCR_SHIFT		2
#define DMAC_DSCR4_DSCR_MASK		0x3fffffff
/** @defgroup dmac_dscr4_dscr DSCR Buffer Transfer Descriptor Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrla4 CTRLA4 DMAC Channel Control A Register (ch_num = 4)
@{*/

/** DMAC_CTRLA4_DONE Current Descriptor Stop Command and Transfer Completed Memory Indicator **/
#define DMAC_CTRLA4_DONE		(1 << 31)

#define DMAC_CTRLA4_DST_WIDTH_SHIFT		28
#define DMAC_CTRLA4_DST_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla4_dst_width DSTWIDTH Transfer Width for the Destination
@{*/
/**@}*/


#define DMAC_CTRLA4_SRC_WIDTH_SHIFT		24
#define DMAC_CTRLA4_SRC_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla4_src_width SRCWIDTH Transfer Width for the Source
@{*/
/**@}*/


#define DMAC_CTRLA4_DCSIZE_SHIFT		20
#define DMAC_CTRLA4_DCSIZE_MASK		0x07
/** @defgroup dmac_ctrla4_dcsize DCSIZE Destination Chunk Transfer Size
@{*/
/**@}*/


#define DMAC_CTRLA4_SCSIZE_SHIFT		16
#define DMAC_CTRLA4_SCSIZE_MASK		0x07
/** @defgroup dmac_ctrla4_scsize SCSIZE Source Chunk Transfer Size.
@{*/
/**@}*/


#define DMAC_CTRLA4_BTSIZE_SHIFT		0
#define DMAC_CTRLA4_BTSIZE_MASK		0xffff
/** @defgroup dmac_ctrla4_btsize BTSIZE Buffer Transfer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrlb4 CTRLB4 DMAC Channel Control B Register (ch_num = 4)
@{*/

/** DMAC_CTRLB4_IEN Interrupt Enable Not **/
#define DMAC_CTRLB4_IEN		(1 << 30)

#define DMAC_CTRLB4_DST_INCR_SHIFT		28
#define DMAC_CTRLB4_DST_INCR_MASK		0x03
/** @defgroup dmac_ctrlb4_dst_incr DSTINCR Incrementing, Decrementing or Fixed Address for the Destination
@{*/
/**@}*/


#define DMAC_CTRLB4_SRC_INCR_SHIFT		24
#define DMAC_CTRLB4_SRC_INCR_MASK		0x03
/** @defgroup dmac_ctrlb4_src_incr SRCINCR Incrementing, Decrementing or Fixed Address for the Source
@{*/
/**@}*/


#define DMAC_CTRLB4_FC_SHIFT		21
#define DMAC_CTRLB4_FC_MASK		0x03
/** @defgroup dmac_ctrlb4_fc FC Flow Control
@{*/
/**@}*/

/** DMAC_CTRLB4_DST_DSCR Destination Address Descriptor **/
#define DMAC_CTRLB4_DST_DSCR		(1 << 20)
/** DMAC_CTRLB4_SRC_DSCR Source Address Descriptor **/
#define DMAC_CTRLB4_SRC_DSCR		(1 << 16)

/**@}*/

/** @defgroup dmac_cfg4 CFG4 DMAC Channel Configuration Register (ch_num = 4)
@{*/


#define DMAC_CFG4_FIFOCFG_SHIFT		28
#define DMAC_CFG4_FIFOCFG_MASK		0x03
/** @defgroup dmac_cfg4_fifocfg FIFOCFG FIFO Configuration
@{*/
/**@}*/


#define DMAC_CFG4_AHB_PROT_SHIFT		24
#define DMAC_CFG4_AHB_PROT_MASK		0x07
/** @defgroup dmac_cfg4_ahb_prot AHBPROT AHB Protection
@{*/
/**@}*/

