grevaillot/svd_tools/headers/ATSAM3X8H/dmac.h
/** DMAC_CFG4_LOCK_IF_L Master Interface Arbiter Lock **/
#define DMAC_CFG4_LOCK_IF_L		(1 << 22)
/** DMAC_CFG4_LOCK_B Bus Lock **/
#define DMAC_CFG4_LOCK_B		(1 << 21)
/** DMAC_CFG4_LOCK_IF Interface Lock **/
#define DMAC_CFG4_LOCK_IF		(1 << 20)
/** DMAC_CFG4_SOD Stop On Done **/
#define DMAC_CFG4_SOD		(1 << 16)
/** DMAC_CFG4_DST_H2SEL Software or Hardware Selection for the Destination **/
#define DMAC_CFG4_DST_H2SEL		(1 << 13)
/** DMAC_CFG4_SRC_H2SEL Software or Hardware Selection for the Source **/
#define DMAC_CFG4_SRC_H2SEL		(1 << 9)

#define DMAC_CFG4_DST_PER_SHIFT		4
#define DMAC_CFG4_DST_PER_MASK		0x0f
/** @defgroup dmac_cfg4_dst_per DSTPER Destination with Peripheral identifier
@{*/
/**@}*/


#define DMAC_CFG4_SRC_PER_SHIFT		0
#define DMAC_CFG4_SRC_PER_MASK		0x0f
/** @defgroup dmac_cfg4_src_per SRCPER Source with Peripheral identifier
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_saddr5 SADDR5 DMAC Channel Source Address Register (ch_num = 5)
@{*/


#define DMAC_SADDR5_SADDR_SHIFT		0
#define DMAC_SADDR5_SADDR_MASK		0xffffffff
/** @defgroup dmac_saddr5_saddr SADDR Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_daddr5 DADDR5 DMAC Channel Destination Address Register (ch_num = 5)
@{*/


#define DMAC_DADDR5_DADDR_SHIFT		0
#define DMAC_DADDR5_DADDR_MASK		0xffffffff
/** @defgroup dmac_daddr5_daddr DADDR Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_dscr5 DSCR5 DMAC Channel Descriptor Address Register (ch_num = 5)
@{*/


#define DMAC_DSCR5_DSCR_SHIFT		2
#define DMAC_DSCR5_DSCR_MASK		0x3fffffff
/** @defgroup dmac_dscr5_dscr DSCR Buffer Transfer Descriptor Address
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrla5 CTRLA5 DMAC Channel Control A Register (ch_num = 5)
@{*/

/** DMAC_CTRLA5_DONE Current Descriptor Stop Command and Transfer Completed Memory Indicator **/
#define DMAC_CTRLA5_DONE		(1 << 31)

#define DMAC_CTRLA5_DST_WIDTH_SHIFT		28
#define DMAC_CTRLA5_DST_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla5_dst_width DSTWIDTH Transfer Width for the Destination
@{*/
/**@}*/


#define DMAC_CTRLA5_SRC_WIDTH_SHIFT		24
#define DMAC_CTRLA5_SRC_WIDTH_MASK		0x03
/** @defgroup dmac_ctrla5_src_width SRCWIDTH Transfer Width for the Source
@{*/
/**@}*/


#define DMAC_CTRLA5_DCSIZE_SHIFT		20
#define DMAC_CTRLA5_DCSIZE_MASK		0x07
/** @defgroup dmac_ctrla5_dcsize DCSIZE Destination Chunk Transfer Size
@{*/
/**@}*/


#define DMAC_CTRLA5_SCSIZE_SHIFT		16
#define DMAC_CTRLA5_SCSIZE_MASK		0x07
/** @defgroup dmac_ctrla5_scsize SCSIZE Source Chunk Transfer Size.
@{*/
/**@}*/


#define DMAC_CTRLA5_BTSIZE_SHIFT		0
#define DMAC_CTRLA5_BTSIZE_MASK		0xffff
/** @defgroup dmac_ctrla5_btsize BTSIZE Buffer Transfer Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_ctrlb5 CTRLB5 DMAC Channel Control B Register (ch_num = 5)
@{*/

/** DMAC_CTRLB5_IEN Interrupt Enable Not **/
#define DMAC_CTRLB5_IEN		(1 << 30)

#define DMAC_CTRLB5_DST_INCR_SHIFT		28
#define DMAC_CTRLB5_DST_INCR_MASK		0x03
/** @defgroup dmac_ctrlb5_dst_incr DSTINCR Incrementing, Decrementing or Fixed Address for the Destination
@{*/
/**@}*/


#define DMAC_CTRLB5_SRC_INCR_SHIFT		24
#define DMAC_CTRLB5_SRC_INCR_MASK		0x03
/** @defgroup dmac_ctrlb5_src_incr SRCINCR Incrementing, Decrementing or Fixed Address for the Source
@{*/
/**@}*/


#define DMAC_CTRLB5_FC_SHIFT		21
#define DMAC_CTRLB5_FC_MASK		0x03
/** @defgroup dmac_ctrlb5_fc FC Flow Control
@{*/
/**@}*/

/** DMAC_CTRLB5_DST_DSCR Destination Address Descriptor **/
#define DMAC_CTRLB5_DST_DSCR		(1 << 20)
/** DMAC_CTRLB5_SRC_DSCR Source Address Descriptor **/
#define DMAC_CTRLB5_SRC_DSCR		(1 << 16)

/**@}*/

/** @defgroup dmac_cfg5 CFG5 DMAC Channel Configuration Register (ch_num = 5)
@{*/


#define DMAC_CFG5_FIFOCFG_SHIFT		28
#define DMAC_CFG5_FIFOCFG_MASK		0x03
/** @defgroup dmac_cfg5_fifocfg FIFOCFG FIFO Configuration
@{*/
/**@}*/


#define DMAC_CFG5_AHB_PROT_SHIFT		24
#define DMAC_CFG5_AHB_PROT_MASK		0x07
/** @defgroup dmac_cfg5_ahb_prot AHBPROT AHB Protection
@{*/
/**@}*/

/** DMAC_CFG5_LOCK_IF_L Master Interface Arbiter Lock **/
#define DMAC_CFG5_LOCK_IF_L		(1 << 22)
/** DMAC_CFG5_LOCK_B Bus Lock **/
#define DMAC_CFG5_LOCK_B		(1 << 21)
/** DMAC_CFG5_LOCK_IF Interface Lock **/
#define DMAC_CFG5_LOCK_IF		(1 << 20)
/** DMAC_CFG5_SOD Stop On Done **/
#define DMAC_CFG5_SOD		(1 << 16)
/** DMAC_CFG5_DST_H2SEL Software or Hardware Selection for the Destination **/
#define DMAC_CFG5_DST_H2SEL		(1 << 13)
/** DMAC_CFG5_SRC_H2SEL Software or Hardware Selection for the Source **/
#define DMAC_CFG5_SRC_H2SEL		(1 << 9)

#define DMAC_CFG5_DST_PER_SHIFT		4
#define DMAC_CFG5_DST_PER_MASK		0x0f
/** @defgroup dmac_cfg5_dst_per DSTPER Destination with Peripheral identifier
@{*/
/**@}*/


#define DMAC_CFG5_SRC_PER_SHIFT		0
#define DMAC_CFG5_SRC_PER_MASK		0x0f
/** @defgroup dmac_cfg5_src_per SRCPER Source with Peripheral identifier
@{*/
/**@}*/


/**@}*/

/** @defgroup dmac_wpmr WPMR DMAC Write Protect Mode Register
@{*/


#define DMAC_WPMR_WPKEY_SHIFT		8
#define DMAC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup dmac_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** DMAC_WPMR_WPEN Write Protect Enable **/
#define DMAC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup dmac_wpsr WPSR DMAC Write Protect Status Register
@{*/


#define DMAC_WPSR_WPVSRC_SHIFT		8
#define DMAC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup dmac_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** DMAC_WPSR_WPVS Write Protect Violation Status **/
#define DMAC_WPSR_WPVS		(1 << 0)

/**@}*/
